[
  {
    "id": "1",
    "imageUrl": "img/goldStandartWhey900g.webp",
    "title": "Optimum Nutrition Gold Standard 100% Whey Protein",
    "description": "100% Optimum Whey Gold Standard is a potent pharmaceutical grade protein supplement. Each serving delivers 24 grams of high biologically valued protein and only one gram of fat. It contains no added carbohydrates. Each serving has only three grams of carbohydrates, making it an excellent choice for individuals on low carbohydrate diets.",
    "types": [0, 1],
    "weights": [0.9, 2.2, 4.5],
    "price": 39.95,
    "category": 1,
    "rating": 10
  },
  {
    "id": "2",
    "imageUrl": "img/bsnPreWorkout833g.webp",
    "title": "BSN No Xplode Pre-Workout",
    "description": "Designed to provide clinical doses of key performance and recovery enhancing amino acids, alongside vital endurance enhancing electrolytes and top tier neuro-stimulants for optimal mental acuity, No Xplode is truly a phenomenal pre-workout.",
    "types": [1],
    "weights": [0.83, 1.2],
    "price": 74.95,
    "category": 4,
    "rating": 8
  },
  {
    "id": "3",
    "imageUrl": "img/scitecNutritionHydroIsolate700g.png",
    "title": "Scitec Nutrition 100% Hydro Isolate",
    "description": "Designed to maximise muscle protein synthesis, Scitec 100% Whey Isolate is a premium grade protein source that delivers maximum levels of amino acids with minimal carbohydrates, lactose and fats.",
    "types": [0, 1],
    "weights": [0.7, 2, 3.5],
    "price": 57,
    "category": 1,
    "rating": 9
  },
  {
    "id": "4",
    "imageUrl": "img/mutantMassGainer6800g.webp",
    "title": "Gainer MASS by MUTANT",
    "description": "Designed specifically for the strongest bodybuilders and weightlifters that walk the earth, MUTANT MASS is now being discovered by other hardcore and dedicated athletes seeking the most powerful gainer they can get their hands on. Now, our latest and greatest formula is here ready to help you unleash your fullest potential.",
    "types": [0, 1],
    "weights": [3.5, 5, 6.8],
    "price": 139.95,
    "category": 2,
    "rating": 8
  },
  {
    "id": "5",
    "imageUrl": "img/myProteinCreatine250g.jpg",
    "title": "Creatine Monohydrate Powder by MYPROTEIN",
    "description": "A popular ingredient in many all-in-one sports supplements, creatine increases your body’s ability to produce energy quickly.",
    "types": [0, 2],
    "weights": [0.25, 0.5],
    "price": 20.5,
    "category": 3,
    "rating": 9
  },
  {
    "id": "6",
    "imageUrl": "img/olimp_pure_whey_isolate.jpg",
    "title": "Pure Whey Isolate 95 by Olimp Sport Nutrition",
    "description": "The Olimp Sport Nutrition brand is proud to present the Olimp Pure Whey Isolate 95 protein supplement, which is an ideal way to supplement your daily diet with an optimal portion of wholesome whey proteins. The product is available in the form of a powder, which, when dissolved in water or milk, allows you to prepare an exceptionally tasty cocktail with a high protein content.",
    "types": [1, 2],
    "weights": [0.6, 1.4, 2.5],
    "price": 40.95,
    "category": 1,
    "rating": 8
  },
  {
    "id": "7",
    "imageUrl": "img/bsnGainer2640g.webp",
    "title": "TRUE MASS gainer by BSN",
    "description": "This supplement has been specially formulated by BSN to build muscle mass at a maximum potential. True Mass is a protein supplement composed of essential ingredients for muscle cells and is ideal for those who need to increase strength and muscle size.",
    "types": [0, 1],
    "weights": [2.64, 4, 5.2],
    "price": 134.95,
    "category": 2,
    "rating": 9
  },
  {
    "id": "8",
    "imageUrl": "img/musclepharmCreatine300g.webp",
    "title": "Creatine Monohydrate Powder by MusclePharm",
    "description": "This creatine product from MusclePharm has an enhanced uptake ability in addition to high bioavailablity. With its clinically backed cinnulin further heightening absorption, its five creatine complexes deliver a range of positive benefits that fire directly into the muscle.",
    "types": [2],
    "weights": [0.3, 0.6, 1.2],
    "price": 25.95,
    "category": 3,
    "rating": 10
  },
  {
    "id": "9",
    "imageUrl": "img/finaflexPreWorkout525g.webp",
    "title": "Stimul8 HARDCORE Pre-Workout by FinalFlex",
    "description": "Redefine yourself with Stimul8 Hardcore by Finaflex. This extreme pre-workout has been built to deliver the ultimate energy, endurance, performance and pump so you can achieve the unachievable.",
    "types": [1],
    "weights": [0.3, 0.5],
    "price": 69.95,
    "category": 4,
    "rating": 8
  },
  {
    "id": "10",
    "imageUrl": "img/trecWhey900g.jpg",
    "title": "Trec Whey Protein Concentrate 100",
    "description": "It contains high-quality whey protein concentrate, which is a source of complete animal proteins and contains all essential amino acids, including BCAA and L-glutamine.",
    "types": [0, 1],
    "weights": [0.9, 2.2, 4.5],
    "price": 48.95,
    "category": 1,
    "rating": 7
  },
  {
    "id": "11",
    "imageUrl": "img/optimumNutritionCeatine600g.webp",
    "title": "Micronized creatine powder by Optimum Nutrition",
    "description": "This micronized creatine powder from Optimum Nutrition packs a full 5 grams (5000 mg) of ultra pure creatine monohydrate per serving. Their unique production methodology is used to produce this creatine yielding a tasteless and odourless product that mixes easily into the beverage of your choice.",
    "types": [1, 2],
    "weights": [0.6, 1.2],
    "price": 63.96,
    "category": 3,
    "rating": 9
  },
  {
    "id": "12",
    "imageUrl": "img/muscletechGainer3180g.webp",
    "title": "Mass Tech by MuscleTech",
    "description": "Mass Tech by MuscleTech has a combination of ingredients designed for the hard gainers. With a solid amount of protein per serve and carbohydrate, you will see even better results when you combine this supplement with the right diet and exercise plan for your goals.",
    "types": [0, 1],
    "weights": [1.9, 3.2, 4.7],
    "price": 87.96,
    "category": 2,
    "rating": 8
  },
  {
    "id": "13",
    "imageUrl": "img/redcon1PreWorkout315g.webp",
    "title": "Big Noise by Redcon1",
    "description": "Big Noise is Redcon1’s flagship stimulant-free pre-workout formula designed to give you monster pumps, deliver maximum nutrients and improve neural activity in the brain for optimal focus and mood enhancement.",
    "types": [2],
    "weights": [0.35, 0.9],
    "price": 21.96,
    "category": 4,
    "rating": 7
  },
  {
    "id": "14",
    "imageUrl": "img/bsnSynthaWhey1320g.webp",
    "title": "Syntha-6 Protein by BSN ",
    "description": "Syntha-6 Protein Ultra Premium Protein Matrix from BSN is a superior protein product that contains up to six forms of five-star slow release protein. Essential amino acids are crucial for protein synthesis and this product helps maintain the amino acid well.",
    "types": [0, 1],
    "weights": [1.1, 2.3],
    "price": 59.96,
    "category": 1,
    "rating": 9
  },
  {
    "id": "15",
    "imageUrl": "img/dymatizePreWorkout400g.webp",
    "title": "Pre W.O. by Dymatize",
    "description": "Designed and engineered to enhance anaerobic performance through strength and power optimisation, Dymatize Pre W.O provides maximally dosed and clinically researched ingredients for maximum benefit.",
    "types": [1, 2],
    "weights": [0.4, 0.9],
    "price": 63.96,
    "category": 4,
    "rating": 8
  },
  {
    "id": "16",
    "imageUrl": "img/muscletechGainerExtreme3180g.webp",
    "title": "Mass Tech Extreme 2000 by MuscleTech",
    "description": "When you are bulking, eating enough calories from food alone can be difficult. MuscleTech has crafted a mass gainer protein supplement that will help you achieve the physique you have been working so hard for.",
    "types": [0, 1],
    "weights": [1.8, 3.2],
    "price": 71.96,
    "category": 2,
    "rating": 8
  },
  {
    "id": "17",
    "imageUrl": "img/dymatizeCreatine500g.webp",
    "title": "Creatine micronized by Dymatize",
    "description": "This is a 100 percent pure pharmaceutical grade creatine monohydrate from the Dymatize crew that's designed for improving athletic performance during high-intensity physical activity such as weight training, HITT, crossfit, running or any other aerobic/anaerobic session.",
    "types": [1, 2],
    "weights": [0.5, 0.9],
    "price": 23.96,
    "category": 3,
    "rating": 9
  },
  {
    "id": "18",
    "imageUrl": "img/scitecNutritionWhey920g.png",
    "title": "Whey Protein Professional by Scitec Nutrition",
    "description": "100% Whey Protein Professional has a combination of whey protein, digestive enzymes and other essential amino acids, giving you a complete blend so you can reach your goals. Having a high-quality protein powder is essential when you are trying to get to your results.",
    "types": [0, 1],
    "weights": [0.9, 1.5, 2.3],
    "price": 63.96,
    "category": 1,
    "rating": 8
  },
  {
    "id": "19",
    "imageUrl": "img/muscletechPreWorkout387g.webp",
    "title": "Shatter by Muscletech",
    "description": "This cutting-edge formula contains a range of ingredients designed to support your body and fitness goals. It contains a full-branched-chain amino acids matrix to get your body firing through your sessions and a sensory blend to sprinkle magic into your workouts.",
    "types": [1, 2],
    "weights": [0.4, 0.9],
    "price": 39.96,
    "category": 4,
    "rating": 6
  },
  {
    "id": "20",
    "imageUrl": "img/optimumNutritionGainer2720g.webp",
    "title": "Serious Mass by Optimum Nutrition",
    "description": "Because you can only consume so much food Optimum Nutrition have produced this weight gain formula for those people looking to pack on some serious mass. Make no mistake this is a beast of a weight gainer because a serving of this will deliver 1250 calories from 50 grams of protein and more than 250 grams of carbohydrates.",
    "types": [0, 1],
    "weights": [2.7, 5.4],
    "price": 63.96,
    "category": 2,
    "rating": 10
  },
  {
    "id": "21",
    "imageUrl": "img/bsnCreatine309g.webp",
    "title": "Creatine DNA by BSN",
    "description": "Backed by loads of scientific research, you can be sure that creatine is going to help you go that extra mile. Creatine DNA by BSN is a fantastic creatine product to look into because it’s designed to contain nothing but the best of the best.",
    "types": [2],
    "weights": [0.3, 0.7],
    "price": 39.96,
    "category": 3,
    "rating": 10
  },
  {
    "id": "22",
    "imageUrl": "img/optimumNutritionPreWorkout400g.webp",
    "title": "Gold Standard Pre Advanced by Optimum Nutrition",
    "description": "Gold Standard Pre Advanced by Optimum Nutrition is the ultimate supplement for anyone looking to take their training sessions to the next level. Designed to help you unleash intense energy and pumps, this advanced pre-workout supplement has been formulated with a combination of caffeine, micronized l-citrulline, beta-alanine, and electrolytes.",
    "types": [1],
    "weights": [0.4, 0.8],
    "price": 55.96,
    "category": 4,
    "rating": 8
  }
]
